# 데이터프레임 행, 열 선택 및 필터하기

In [15]:
import pandas as pd

In [2]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

C:\Users\InT\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [3]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [4]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
df = df[1:3]

In [6]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [10]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]

df = pd.DataFrame.from_items(friend_list)
df

C:\Users\InT\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### Jenny만 빼고 필요할 때, loc()함수 사용

In [11]:
df.loc[ [0,2] ]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [12]:
df = df.loc[[0,2]]

In [13]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [14]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]

df = pd.DataFrame.from_items(friend_list)
df

C:\Users\InT\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by column condition

In [16]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df.query('age > 25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df[(df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

In [23]:
df.query(('age>25') and 'name=="Nate"')

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [25]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [27]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [28]:
df.iloc[0:2:,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [31]:
df = pd.read_csv('pandas_data/friend_list_no_head.csv', header=None, names=['name','age','job'])

In [32]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brain   45    manager
5  Chris   25     intern

In [33]:
df_filtered = df[['name','age']]

In [34]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brain   45
5  Chris   25

### filter함수를 사용해서 age,name 열만 출력

In [35]:
df.filter(items=['age','name'])

   age   name
0   20   John
1   30  Jenny
2   30   Nate
3   40  Julia
4   45  Brain
5   25  Chris

### 열에 문자 'a'를 포함하는 열만 출력

In [36]:
#axis = 1 : 기준이 열 이라는 뜻
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brain   45
5  Chris   25

### 정규식을 이용하여 속성 이름 중, b로 끝나는 열만 출력

In [37]:
df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

### 정규식을 이용하여 속성 이름 중, e로 끝나는 열만 출력

In [38]:
df.filter(regex='e$',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brain   45
5  Chris   25